tutorials/trainingTrack/system/elementData
// Blade element data
// axialDistance, radius, azimuth, chord, chordMount, twist
(0.0    0.01      0.0     0.020145    0.25     -53.52825213)
(0.0    0.015     0.0     0.022977    0.25     -42.04660568)
(0.0    0.02      0.0     0.025557    0.25     -34.07475497)
(0.0    0.025     0.0     0.027903    0.25     -28.41900823)
(0.0    0.03      0.0     0.03        0.25     -24.27247059)
(0.0    0.035     0.0     0.031758    0.25     -21.13247156)
(0.0    0.04      0.0     0.033024    0.25     -18.6857556)
(0.0    0.045     0.0     0.033798    0.25     -16.7321444)
(0.0    0.05      0.0     0.033864    0.25     -15.13965812)

