tutorials/trainingTrack/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name 	refCylinder;
        type	cellSet;
        action	new;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder; 
	    p1 (-0.03 0 0);
	    p2 (0.2 0 0);
	    radius 0.07;
        }
    }

    {
        name 	refCylinder;
        type	cellSet;
        action	add;
        source	cylinderToCell;
        sourceInfo
        {
            type cylinder; 
            p1 (-0.03 0 0);
            p2 (0.2 0 0);
            radius 0.005;
        }
    }

    {
        name    refCylinder;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set refCylinder;
        }
    }
);

// ************************************************************************* //
